Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Tween animation calculates the animation with information such as the start point, end point, size, rotation, and other common aspects of an animation.
zh_cn: 补间动画使用动画的起点、终点、大小、旋转和其他常见方面的信息计算动画。

source: Two common physics-based animations are the following:
zh_cn: 以下是两种常见的基于物理的动画：

source: UI designers sometimes create deep hierarchies of nested ViewGroup objects in order to get the UI to behave properly.
zh_cn: UI 设计人员有时会创建嵌套的 ViewGroup 对象的深层次结构，以使 UI 正常运行。

source: UI elements fade in and out instead of appearing and disappearing.
zh_cn: UI 元素淡入淡出而不是出现和消失。

source: Unlike the built-in views, your custom view can make application-specific assumptions about the size and shape of its children, and thus avoid traversing its children to calculate measurements.
zh_cn: 与内置 view 不同，你的自定义 view 可以针对其子项的大小和形状进行特定于应用程序的假设，从而避免遍历其子项以计算度量。

source: Use AnimatedVectorDrawable
zh_cn: 使用 AnimatedVectorDrawable

source: Use AnimationDrawable
zh_cn: 使用 AnimationDrawable

source: Use Lint
zh_cn: 使用 Lint

source: Use compound drawables - A LinearLayout which contains an ImageView and a TextView can be more efficiently handled as a compound drawable.
zh_cn: 使用复合 drawable - LinearLayout 其中包含一个 ImageView 和 TextView 可以替换为一个复合 drawable 可以更有效地处理。

source: Use the <include> tag
zh_cn: 使用 <include> 标签

source: Use the <merge> tag
zh_cn: 使用 <merge> 标签

source: Use the Custom Component
zh_cn: 使用自定义的组件

source: Use your new extension class.
zh_cn: 使用你新的继承类。

source: Useless leaf - A layout that has no children or no background can often be removed (since it is invisible) for a flatter and more efficient layout hierarchy.
zh_cn: 无用的叶子 - 没有子级或背景的布局通常可以删除(因为它是不可见的)，以获得更平坦和更高效的布局层次。

source: Useless parent - A layout with children that has no siblings, is not a ScrollView or a root layout, and does not have a background, can be removed and have its children moved directly into the parent for a flatter and more efficient layout hierarchy.
zh_cn: 无用的父级 - 具有没有同级子级、不是 ScrollView 或根级布局且没有背景的布局，可以删除并将其子级直接移到父级中，以获得更平坦、更高效的布局层次结构。

source: User actions are turned into events that trigger callbacks, and you can override the callbacks to customize how your application responds to the user.
zh_cn: 用户操作将转换为触发回调的事件，你可以重写回调以自定义应用程序响应用户的方式。

source: Users also sense subtle behavior or feel in an interface, and react best to subtleties that mimic the real world.
zh_cn: 用户还可以在界面中感受微妙的行为或感觉，并对模仿现实世界的细微之处做出最佳反应。

source: Users expect a modern UI to transition smoothly between states.
zh_cn: 用户期望现代 UI 在各状态之间平滑过渡。

source: Using a Linux kernel allows Android to take advantage of key security features and allows device manufacturers to develop hardware drivers for a well-known kernel.
zh_cn: 使用 Linux 内核的 Android 利用 关键安全特性，并允许设备制造商开发为知名的内核开发硬件驱动程序。

source: Using this mode on either the height or width also allows you to set a size ratio.
zh_cn: 在“高度”或“宽度”上使用此模式还可以设置大小比。

source: Using this tool helps you discover bottlenecks in the layout performance.
zh_cn: 使用这个工具可以帮助你发现在布局中的性能瓶颈。

source: Usually there are many of these processes running, so they are kept in an LRU list to ensure the process that was most recently seen by the user is the last to be killed when running low on memory.
zh_cn: 通常有许多这样的进程在运行，因此它们被保存在 LRU 列表中，以确保用户最近看到的进程是在内存不足时最后被终止的进程。

source: Usually, these animations are defined statically with a drawable resource, but you can also define the animation behavior at runtime.
zh_cn: 通常，这些动画是使用 drawable 资源静态定义的，但你也可以在运行时定义动画行为。

source: Various application components can cause its containing process to be considered foreground in different ways.
zh_cn: 不同的应用组件可以用不同的方式，使其包含进程被认为是前台进程。

source: View Animation
zh_cn: View 动画

source: View C is constrained to a barrier, which moves based on the position/size of both view A and view B
zh_cn: 视图 C 被限制为一个屏障，其移动同时基于图 A 和图 B 的位置/尺寸

source: View C is now vertically constrained below view A
zh_cn: view C 现在垂直限制在 view A 下方

source: View animation
zh_cn: View 动画

source: Views are redrawn very frequently, and many drawing objects require expensive initialization.
zh_cn: view 重新绘制非常频繁，许多绘制对象需要昂贵的初始化。

source: Visually, this process creates an abrupt stop in the animation, and a disjointed movement afterwards, as shown in figure 3.
zh_cn: 从视觉上看，这个过程会在动画中创建一个突然的停止，和一个脱节的运动，如图 3 所示。

source: We now have our custom component, but how can we use it?
zh_cn: 我们现在有自己的自定义组件了，怎么使用呢？

source: Well-written custom views can also be added and styled via XML.
zh_cn: 编写良好的自定义 view 也可以通过 XML 添加和设置样式。

source: When a broadcast is sent, the system automatically routes broadcasts to apps that have subscribed to receive that particular type of broadcast.
zh_cn: 发送广播时，系统会自动将广播路由到已订阅接收该特定类型广播的应用程序。

source: When a framework API makes a call to access device hardware, the Android system loads the library module for that hardware component.
zh_cn: 当一个框架 API 调用访问设备硬件时，Android 系统加载该硬件组件的库模块。

source: When a view is created from an XML layout, all of the attributes in the XML tag are read from the resource bundle and passed into the view's constructor as an AttributeSet.
zh_cn: 从 XML 布局创建 view 时，XML 标记中的所有属性都从资源包中读取，并作为 AttributeSet 传递到 view 的构造函数中。

source: When creating constraints, remember the following rules:
zh_cn: 创建约束时，请记住以下规则：

source: When deciding how to classify a process, the system will base its decision on the most important level found among all the components currently active in the process.
zh_cn: 在决定如何对进程进行分类时，系统将根据在进程中当前活动的所有组件中找到的最重要级别来进行决策。

source: When selecting a view, the Attributes window includes controls for 1 size ratio, 2 deleting constraints, 3 height/width mode, 4 margins, and 5 constraint bias.
zh_cn: 当选择一个视图，在 Attributes 窗口包括用于控制 1 尺寸比，2 删除约束，3 高度/宽度模式，4 边距和 5 约束偏移。

source: When the ValueAnimator is done calculating an elapsed fraction, it calls the TimeInterpolator that is currently set, to calculate an interpolated fraction.
zh_cn: 当 ValueAnimator 完成经过分数的计算时，它调用当前设置的 TimeInterpolator，来计算 interpolated fraction (插值分数)。

source: When the chain is set to either spread or spread inside, you can fill the remaining space by setting one or more views to "match constraints" (0dp).
zh_cn: 当链被设置为 spread 或 spread inside，你可以通过将一个或多个 view 设置为(0dp)来填充剩余空间。

source: When the class is nested in the NoteEditor class, this technique will not work.
zh_cn: 当这个类嵌套在 NoteEditor 类中时，这个技巧将无效。

source: When the constraint is created, the editor gives it a default margin to separate the two views.
zh_cn: 创建约束时，编辑器会给它一个 default margin 来分隔两个视图。

source: When the interpolated fraction is calculated, ValueAnimator calls the appropriate TypeEvaluator, to calculate the value of the property that you are animating, based on the interpolated fraction, the starting value, and the ending value of the animation.
zh_cn: 计算插值分数后，ValueAnimator 调用相应的 TypeEvaluator，根据插值分数、动画的起始值和结束值计算要设置动画的属性的值。

source: When we are finished, the new class will be able to substitute for a normal EditText view.
zh_cn: 当我们完成后，新的类可以替换一个正常的 EditText 类。

source: When you add a constraint to both sides of a view (and the view size for the same dimension is either "fixed" or "wrap content"), the view becomes centered between the two constraints with a bias of 50% by default.
zh_cn: 当向 view 的两侧添加约束时(并且 view 的尺寸的大小为 "fixed" 或 "wrap content")，默认情况下，view 将在两个约束之间居中，偏差为 50%。

source: When you add a view in a ConstraintLayout, it displays a bounding box with square resizing handles on each corner and circular constraint handles on each side.
zh_cn: 当你在 ConstraintLayout 中添加一个 view 时，它会显示一个边框，每个角上都有方形调整大小的手柄，每边都有圆形的约束手柄。

source: When you apply a ConstraintSet to a displayed ConstraintLayout, the layout updates the constraints of all of its children.
zh_cn: 将 ConstraintSet 应用于显示的 ConstraintLayout 时，布局将更新其所有子级的约束。

source: When you call sendBroadcast(Intent, String) or sendOrderedBroadcast(Intent, String, BroadcastReceiver, Handler, int, String, Bundle), you can specify a permission parameter.
zh_cn: 当你调用 sendBroadcast(Intent, String) 或 sendOrderedBroadcast(Intent, String, BroadcastReceiver, Handler, int, String, Bundle) 时，可以指定一个权限参数。

source: When you call start() the animation begins.
zh_cn: 当你调用 start() 时，动画开始。

source: When you define a vector drawable that you want to animate, use the android:name attribute to assign a unique name to groups and paths, so you can refer to them from your animator definitions.
zh_cn: 定义要设置动画的 vector drawable 时，请使用 android:name 属性为组和路径指定一个唯一的名称，以便可以从动画器定义中引用它们。

source: When you drop a view into the Layout Editor, it stays where you leave it even if it has no constraints.
zh_cn: 当你拖动一个 view 到布局编辑器中，它会停留在你放开它的地方，即使它没有任何约束。

source: When you need to change the visibility or position of views in your layout, you should include subtle animations to help the user understand how the UI is changing.
zh_cn: 当你需要更改视图在布局中的可见性或位置时，你应该包含一些细微的动画，以帮助用户了解 UI 是如何更改的。

source: When you pass onTouchEvent() a touch event that it doesn't recognize as part of a gesture, it returns false.
zh_cn: 当你传递 onTouchEvent() 触摸事件时，它无法识别为手势的一部分，它将返回 false。

source: When you register a receiver, any app can send potentially malicious broadcasts to your app's receiver.
zh_cn: 注册接收器时，任何应用都可以向应用的接收器发送潜在的恶意广播。

source: When you want to animate a bitmap graphic such as an icon or illustration, you should use the drawable animation APIs.
zh_cn: 当你想动画位图图形，例如图标或插图，你应该使用 drawable 动画 API。

source: When you want to load the layout specified by the ViewStub, either set it visible by calling setVisibility(View.VISIBLE) or call inflate().
zh_cn: 当你要加载由 ViewStub 指定的布局时，可以通过调用 setVisibility(View.VISIBLE) 将其设置为 visible，或调用 inflate()。

source: When your UI changes in response to user action, you should animate the layout transitions.
zh_cn: 当用户界面响应用户操作而更改时，应设置布局转换的动画。

source: When your view is assigned a size, the layout manager assumes that the size includes all of the view's padding.
zh_cn: 为 view 指定大小时，布局管理器会假定该大小包含所有 view 的 padding。

source: Whenever possible, your animations should apply real-world physics so they are natural-looking.
zh_cn: 只要可能，你的动画应该应用现实世界的物理，使他们是自然的外观。

source: Whereas, animations built by with physics-based animation APIs such as DynamicAnimation are driven by force.
zh_cn: 然而，使用基于物理的动画 API 如 DynamicAnimation 生成的动画是由力驱动的。

source: Whether or not you use GestureDetector.SimpleOnGestureListener, you must always implement an onDown() method that returns true.
zh_cn: 无论你是否使用 GestureDetector.SimpleOnGestureListener，你必须始终实现返回 true 的 onDown() 方法。

source: Whether they are item details, progress indicators, or undo messages, you can reduce memory usage and speed up rendering by loading the views only when they are needed.
zh_cn: 无论是项目详细信息、进度指示器还是撤消消息，都可以通过仅在需要视图时加载视图来减少内存使用并加快渲染速度。

source: While both have default behavior, the default onDraw() will do nothing, and the default onMeasure() will always set a size of 100x100 — which is probably not what you want.
zh_cn: 虽然这 2 个方法都有默认的行为，默认的 onDraw() 什么也不做，默认的 onMeasure() 将设置尺寸为 100x100 — 这可能并不是你想的。

source: While you can define the frames of an animation in your code, using the AnimationDrawable class API, it's more simply accomplished with a single XML file that lists the frames that compose the animation.
zh_cn: 虽然可以在代码中定义动画的帧，但使用 AnimationDrawable 类 API ，但可以更简单地使用一个列出构成动画的帧的 XML 文件来完成。

source: With Android Studio, you can also run lint inspections for a specific build variant, or for all build variants.
zh_cn: 使用 Android Studio，你还可以对特定的构建变体或所有构建变体运行 lint 检查。

source: With the property animation system, these constraints are completely removed, and you can animate any property of any object (Views and non-Views) and the object itself is actually modified.
zh_cn: 使用属性动画系统，这些约束将被完全删除，你可以设置任何对象(视图和非视图)的任何属性的动画，并且对象本身实际上已被修改。

source: With this XML saved as hyperspace_jump.xml in the res/anim/ directory of the project, the following code will reference it and apply it to an ImageView object from the layout.
zh_cn: 在项目的 res/anim/ 目录中将此 XML 保存为 hyperspace_jump.XML 后，下面的代码将引用它并将其应用于布局中的 ImageView 对象。

source: With this XML saved as rocket_thrust.xml in the res/drawable/ directory of the project, it can be added as the background image to a View and then called to play.
zh_cn: 在项目的 res/drawable/ 目录中将此 XML 保存为 rocket_thrust.XML 后，可以将其作为背景图像添加到视图中，然后调用以播放。

source: Within a <Constraint>, you can use the <CustomAttribute> element to specify a transition for attributes that aren't simply related to position or View attributes.
zh_cn: 在 <Constraint> 中，你可以使用 <CustomAttribute> 元素为不只是与位置或 View 属性相关的属性指定转换。

source: Within a ConstraintLayout, you can animate changes to the size and position of elements by using ConstraintSet and TransitionManager.
zh_cn: 在 ConstraintLayout 中，可以使用 ConstraintSet 和 TransitionManager 设置元素大小和位置的更改动画。

source: Within a MotionScene file, ConstraintSet elements can contain additional attributes that are interpolated during transition.
zh_cn: 在 MotionScene 文件中，ConstraintSet 元素可以包含在转换期间插值的其他属性。

source: Work required to animate your UI is added to the animation stage of the rendering pipeline.
zh_cn: 动画化用户界面所需的工作将添加到渲染管道的 animation stage。

source: XML file saved at res/anim/hyperspace_jump.xml:
zh_cn: XML 文件保存在 res/anim/hyperspace_jump.XML：

source: XML file saved at res/anim/my_overshoot_interpolator.xml:
zh_cn: XML 文件保存在 res/anim/my_overshoot_interpolator.XML：

source: XML file saved at res/animator/property_animator.xml:
zh_cn: XML 文件保存在 res/animator/property_animator.XML：

source: XML file saved at res/drawable/rocket.xml:
zh_cn: XML 文件保存在 res/drawable/rocket.XML：

source: You also need to make your view respond to user input in a way that closely resembles the real-world action you're mimicking.
zh_cn: 你还需要使 view 以与你模仿的真实动作非常相似的方式响应用户输入。

source: You can add a vertical or horizontal guideline to which you can constrain views, and the guideline will be invisible to app users.
zh_cn: 你可以添加可以约束 view 的垂直或者水平的参考线，并且该参考线对于应用用户而言是不可见的。

source: You can adjust the bias by dragging the bias slider in the Attributes window or by dragging the view, as shown in video 3.
zh_cn: 你可以通过拖动 Attributes 窗口中的“偏移”滑块或拖动视图来调整偏移，如视频 3 所示。

source: You can also constrain views that are inside the barrier to the barrier.
zh_cn: 你还可以将位于屏障 inside (内部) 的视图约束到屏障。

source: You can also create listeners for events that your contained views might generate, for example, a listener method for the List Item Click Listener to update the contents of the EditText if a list selection is made.
zh_cn: 你也可以监听器来临听内部容纳的 view 产生的事件，比如如果设置了 list 选项，可以设置 List Item 的点击监听器来更新 EditText 的内容。

source: You can also highlight individual constraints in the Layout Editor by clicking on them in the 6 constraint list.
zh_cn: 你也可以通过单击 6 约束列表中的各个约束来突出显示布局编辑器中的各个约束。

source: You can also include a guideline inside a barrier to ensure a "minimum" position for the barrier.
zh_cn: 你还可以在屏障内包含一个参考线，以确保屏障的“最小”位置。

source: You can also limit a broadcast to a set of apps in the same organization by calling setPackage(String) on the intent.
zh_cn: 你还可以通过调用 setPackage(String) 来将广播限制为同一组织中的一组应用程序。

source: You can also manage inspection profiles and configure inspections within Android Studio with the File>Settings>Project Settings option.
zh_cn: 你还可以使用 File>Settings>Project Settings 选项在 Android Studio 中管理检查配置文件并配置检查。

source: You can also override all the layout parameters (any android:layout_* attributes) of the included layout's root view by specifying them in the <include/> tag.
zh_cn: 你还可以通过在 <include/> 标签中指定布局参数，来覆盖包含的布局的根视图的所有布局参数(任何 android:layout 属性)。

source: You can also select all the views you want to align, and then click Align in the toolbar to select the alignment type.
zh_cn: 你还可以选择所有要对齐的 view，然后单击工具栏中的 Align 来选择对齐方式。

source: You can also specify a custom TypeEvaluator for int, float, and color values as well, if you want to process those types differently than the default behavior.
zh_cn: 如果要以不同于默认行为的方式处理这些类型，还可以为 int、float 和颜色值指定自定义的 TypeEvaluator。

source: You can also specify animations to have a non-linear interpolation.
zh_cn: 你还可以指定动画具有非线性插值。

source: You can also specify whether you want the animation to play back in reverse.
zh_cn: 还可以指定是否希望动画反向播放。

source: You can apply simple animations such as sliding the new activity in from the side or fading it in, but you can also create animations that transition between shared views in each activity.
zh_cn: 你可以应用简单的动画，例如从侧面滑入或淡入新 activity，但也可以创建在每个 activity 中的共享视图之间切换的动画。

source: You can attach additional information to the intent with putExtra(String, Bundle).
zh_cn: 你可以使用 putExtra(String, Bundle) 将附加信息附加到 intent 中。

source: You can change the way the height and width are calculated by clicking the symbols indicated with callout 3 in figure 14.
zh_cn: 你可以通过单击图 10 中标注 3 所示的符号来更改计算高度和宽度的方式。

source: You can choose any alias you want for your namespace.
zh_cn: 你可以为命名空间选择所需的任何别名。

source: You can control the margin for each view in the Attributes window by clicking the number on the line that represents each constraint (in figure 13, callout 4 shows the bottom margin is set to 16dp).
zh_cn: 你可以通过单击表示每个约束的行上的数字来控制 Attributes 窗口中每个视图的边距(在图 13 中，callout4 显示底部边距设置为 16dp)。

source: You can create constraints only between a constraint handle and an anchor point that share the same plane.
zh_cn: 只能在共享的同一平面的约束句柄和锚点之间创建约束。

source: You can define an animation to change any object property over time, regardless of whether it draws to the screen or not.
zh_cn: 可以定义动画以随时间更改任何对象属性，而不管它是否绘制到屏幕。

source: You can define the distance from the edge with margin.
zh_cn: 你可以使用 margin 定义到边缘的距离。

source: You can delete a constraint by doing any of the following:
zh_cn: 可以通过执行以下任一操作删除约束：

source: You can determine how a transformation is applied over time by assigning an Interpolator.
zh_cn: 你可以通过指定一个 Interpolator 来确定如何随时间应用变换。

source: You can do all of the things you would do with a fully customized component, but by starting with a more specialized class in the View hierarchy, you can also get a lot of behavior for free that probably does exactly what you want.
zh_cn: 一个完全自定义的可以做的，继承一个更特定的 view 也可以做，而且你还能免费获得更多的行为，也许正是你想要的行为。

source: You can enforce restrictions on either the sender or receiver of a broadcast.
zh_cn: 你可以对广播的发送者或接收器实施限制。

source: You can find most of the property animation system's APIs in android.animation.
zh_cn: 你可以在 android.animation 中找到属性动画系统的大部分 API。

source: You can find out if your animations impact the performance of your app by enabling Profile GPU Rendering and monitoring the animation stage.
zh_cn: 通过启用 Profile GPU Rendering 并监视动画阶段，可以确定动画是否影响应用程序的性能。

source: You can group animation elements together inside the <set> element, including other <set> elements.
zh_cn: 可以在 <set> 元素中将动画元素组合在一起，包括其他 <set> 元素。

source: You can implement this technique by defining a ViewStub for those complex and rarely used views.
zh_cn: 你可以通过为那些复杂且很少使用的视图定义一个 ViewStub 来实现这一技术。

source: You can limit yourself to only local broadcasts with LocalBroadcastManager.
zh_cn: 你可以仅使用 LocalBroadcastManager 进行本地广播。

source: You can offset the alignment by dragging the view inward from the constraint.
zh_cn: 你可以通过从视图向内拖动约束来偏移对齐。

source: You can position the guideline within the layout based on either dp units or percent, relative to the layout's edge.
zh_cn: 你可以根据相对于布局边缘的 dp 单位或者百分百在布局中定位参考线。

source: You can send local broadcasts with LocalBroadcastManager.
zh_cn: 你可以使用 LocalBroadcastManager 发送本地广播。

source: You can set animations to play together, sequentially, or after a specified delay.
zh_cn: 可以将动画设置为一起播放、顺序播放或在指定的延迟之后播放。

source: You can set the view size to a ratio such as 16:9 if at least one of the view dimensions is set to "match constraints" (0dp).
zh_cn: 如果至少有一个 view 尺寸设置为 "match constraints" (0dp)，则可以将 view 大小设置为比例，例如 16:9。

source: You can specify a permission when registering a broadcast receiver.
zh_cn: 你可以在注册一个广播接收器时指定权限。

source: You can specify a permission when sending a broadcast.
zh_cn: 你可以在发送广播时指定权限。

source: You can specify either an existing system permission like SEND_SMS or define a custom permission with the <permission> element.
zh_cn: 你可以指定现有的系统权限，如 SEND_SMS，或者使用 <permission> 元素定义自定义权限。

source: You can specify nested <set> tags to further group animations together.
zh_cn: 你可以指定嵌套的 <set> 标签以将动画进一步组合在一起。

source: You can specify the center point of the image from which it grows outward (or inward) by specifying pivotX and pivotY.
zh_cn: 通过指定 pivotX 和 pivotY，可以指定图像向外(或向内)生长的中心点。

source: You can specify the layout using the declarative XML files just like with an activity screen, or you can create views programmatically and nest them into the layout from your code.
zh_cn: 就像 Activity 一样，你可以在 XML 文件中申明布局，也可以通过编程的方式用代码嵌套。

source: You can still use a context-registered receiver when the user is actively using your app.
zh_cn: 当用户正在积极使用你的应用程序时，您仍然可以使用 上下文注册接收器。

source: You can supply a constructor which can take attributes and parameters from the XML, and you can also consume your own such attributes and parameters (perhaps the color and range of the VU meter, or the width and damping of the needle, etc.)
zh_cn: 你可以提供一个构造方法来从 XML 文件中获取属性和参数，你也可以使用这些属性和参数(比如 VU 表范围的颜色，指针的宽度和阻尼等)。

source: You can then adjust the whole chain's bias (left/right or up/down) by changing the chain's head view bias.
zh_cn: 然后，你可以通过更改链头 view 的偏差来调整整个链的偏差(左/右或上/下)。

source: You can then load a ConstraintSet from the second keyframe file and apply it to the displayed ConstraintLayout.
zh_cn: 然后，可以从第二个关键帧文件加载 ConstraintSet，并将其应用于显示的 ConstraintLayout。

source: You can then run your own custom gesture-detection code.
zh_cn: 然后，你可以运行自己的自定义手势检测代码。

source: You can use any floating-point value from 0 (the start of the transition) to 1 (the end of the transition).
zh_cn: 你可以使用任何浮点值，从 0(转换的开始)到 1(转换的结束)。

source: You can use constraints to achieve different types of layout behavior, as described in the following sections.
zh_cn: 你可以使用约束来实现不同类型的布局行为，如一下各章节所述。

source: You can use the corner handles to resize a view, but this hard codes the size so the view will not resize for different content or screen sizes.
zh_cn: 你可以使用拐角手柄来调整 view 大小，但这样会硬编码大小，因此 view 不会调整为不同的内容或屏幕尺寸大小。

source: You can use the view animation system to perform tweened animation on Views.
zh_cn: 你可以使用视图动画系统，在视图上执行补间动画。

source: You can use these methods in onDraw() to create your custom user interface (UI).
zh_cn: 你可以在 onDraw() 中使用这些方法来创建自定义用户界面(UI)。

source: You can use this to swap out the entire UI or to move/replace just some views.
zh_cn: 你可以使用这个来交换整个 UI，或者只移动/替换一些视图。

source: You cannot use match_parent for any view in a ConstraintLayout.
zh_cn: 不能对 ConstraintLayout 中的任何视图使用 match_parent 。

source: You could capture other events like key presses and handle them in some custom way (such as for a game).
zh_cn: 你可以捕获其他事件，比如按键，并且自己处理事件(比如在游戏中)。

source: You could combine a group of View components into a new single component, perhaps to make something like a ComboBox (a combination of popup list and free entry text field), a dual-pane selector control (a left and right pane with a list in each where you can reassign which item is in which list), and so on.
zh_cn: 你可以用一组 View 组件组成一个新的单一组件，比如类似于一个 ComboBox（弹出窗口列表和一个自由输入的文本框的组合）、一个双窗口的选择控制器（左右窗口各有一个列表，你可以重新分配哪些 item 是在所选列表中）等等。（译注：第二个比如日类似日期、时间选择的那种）。

source: You could create a completely custom-rendered View type, for example a "volume control" knob rendered using 2D graphics, and which resembles an analog electronic control.
zh_cn: 你可以创建完全自己渲染的 View 类，比如一个用 2D 图呈现的 "音量控制" 旋扭。

source: You could override the way that an EditText component is rendered on the screen (the Notepad Tutorial uses this to good effect to create a lined notepad page).
zh_cn: 你可以重写 EditText 在屏幕上呈现的方式(Notepad Tutorial 使用这点创建一个按行排的记事本，效果良好)。

source: You have to inflate your animation XML resource by calling loadAnimator() and call setTarget() to set the target object that contains this property.
zh_cn: 必须通过调用 loadAnimator() 来加载动画 XML 资源，并调用 setTarget() 设置包含此属性的目标对象。
